# SetVisionMapping

## Description
Sets the mapping of the lighting device fields from Vectorworks to a visualizer.

```pascal
PROCEDURE SetVisionMapping(
				color     : STRING;
				universe  : STRING;
				gobo      : STRING;
				name      : STRING;
				channel   : STRING;
				fixtureid : STRING);
```

```python

def vs.SetVisionMapping(color, universe, gobo, name, channel, fixtureid):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|color|STRING||
|universe|STRING||
|gobo|STRING||
|name|STRING||
|channel|STRING||
|fixtureid|STRING||

## Version
Availability: from Vectorworks 2018.3
## Category
* Spotlight